const infoConv = {
    "경영관": {
        "복사기": [
            "경영관 1층"
        ],
        "열람실": [
            "경영관 지하1층 비즈마루"
        ],
        "카페": [
            "경영관 야외 그루터기"
        ]
    },
    "과학관": {
        "복사기": [
            "과학관 1층"
        ],
        "유인복사실": [
            "과학관 야외 교재실"
        ],
        "제세동기": [
            "과학관 1층"
        ]
    },
    "다향관": {
        "매점": [
            "다향관 1층"
        ]
    },
    "만해관": {
        "복사기": [
            "만해관 2층"
        ]
    },
    "명진관": {
        "복사기": [
            "명진관 1층"
        ],
        "유인복사실": [
            "명진관 1층"
        ],
        "열람실": [
            "명진관 1층 명진라운지"
        ],
        "atm": [
            "명진관 야외 신한"
        ]
    },
    "문화관": {
        "복사기": [
            "문화관 1층"
        ],
        "atm": [
            "문화관 1층 신한"
        ],
        "증명서자동발급기": [
            "문화관 1층"
        ],
        "제세동기": [
            "문화관 1층"
        ]
    },
    "법학관": {
        "제세동기": [
            "법학관 1층"
        ],
        "매점": [
            "법학관 2층"
        ]
    },
    "본관": {
        "제세동기": [
            "본관 3층"
        ],
        "카페": [
            "본관 야외 가온누리",
            "본관 야외 블루포트"
        ]
    },
    "사회과학관": {
        "복사기": [
            "사회과학관 2층"
        ],
        "열람실": [
            "사회과학관 2층 능금"
        ],
        "증명서자동발급기": [
            "사회과학관 2층"
        ],
        "제세동기": [
            "사회과학관 2층"
        ]
    },
    "상록원": {
        "atm": [
            "상록원 1층 신한 국민"
        ],
        "식당": [
            "상록원 1층",
            "상록원 2층",
            "상록원 3층"
        ],
        "매점": [
            "상록원 1층"
        ]
    },
    "신공학관": {
        "복사기": [
            "신공학관 3층",
            "신공학관 9층"
        ],
        "atm": [
            "신공학관 1층 신한"
        ],
        "식당": [
            "신공학관 1층"
        ],
        "카페": [
            "신공학관 1층"
        ],
        "매점": [
            "신공학관 1층"
        ]
    },
    "원흥관": {
        "복사기": [
            "원흥관 3층"
        ],
        "열람실": [
            "원흥관 3층 북카페",
            "원흥관 3층 i space"
        ],
        "atm": [
            "원흥관 4층 신한"
        ]
    },
    "정보문화관": {
        "복사기": [
            "정보문화관P 3층"
        ]
    },
    "중앙도서관": {
        "복사기": [
            "중앙도서관 지하2층",
            "중앙도서관 지하1층",
            "중앙도서관 1층",
            "중앙도서관 3층",
            "중앙도서관 4층"
        ],
        "유인복사실": [
            "중앙도서관 지하1층"
        ],
        "증명서자동발급기": [
            "중앙도서관 2층"
        ],
        "매점": [
            "중앙도서관 4층"
        ]
    },
    "학림관": {
        "복사기": [
            "학림관 1층",
            "학림관 2층"
        ],
        "열람실": [
            "학림관 1층 라운지 샘"
        ],
        "atm": [
            "학림관 1층 신한"
        ],
        "증명서자동발급기": [
            "학림관 1층"
        ],
        "제세동기": [
            "학림관 1층"
        ],
        "매점": [
            "학림관 지하1층"
        ]
    },
    "학생회관": {
        "복사기": [
            "학생회관 1층"
        ],
        "열람실": [
            "학생회관 1층 i space"
        ]
    },
    "학술관": {
        "복사기": [
            "학술관 1층"
        ],
        "식당": [
            "학술관 지하1층 가든쿡"
        ],
        "카페": [
            "학술관 지하1층 두리터"
        ]
    },
    "혜화관": {
        "복사기": [
            "혜화관 1층"
        ],
        "열람실": [
            "혜화관 1층 라운지"
        ],
        "atm": [
            "혜화관 1층 국민"
        ],
        "카페": [
            "혜화관 1층 무인카페",
            "혜화관 야외 카페ing"
        ],
        "매점": [
            "혜화관 4층"
        ]
    }
}
export default infoConv;