const infoConv = {
    "경영관": {
        "복사기": [
            {
                location: "경영관 1층",
                img: "/편의시설이미지/경영관/경영관_1_복사기.png"
            }         
        ],
        "열람실": [
            {
                location: "경영관 지하1층 비즈마루",
                img: "/편의시설이미지/경영관/경영관_비즈마루.jpeg"
            }
        ],
        "카페": [
            {
                location: "경영관 야외 그루터기",
                img: "/편의시설이미지/경영관/경영관_야외_카페그루터기.png"
            }
        ]
    },
    "과학관": {
        "복사기": [
            {
                location: "과학관 1층",
                img: "/편의시설이미지/과학관/과학관_1_복사기.png"
            }
        ],
        "유인복사실": [
            {
                location: "과학관 야외 교재실",
                img: "/편의시설이미지/과학관/과학관_바깥_교재실.png"
            }
        ],
        "제세동기": [
            {
                location: "과학관 1층",
                img: "/편의시설이미지/과학관/과학관_1_제세동기.png"
            }
        ]
    },
    "다향관": {
        "매점": [
            {
                location: "다향관 1층",
                img: "/편의시설이미지/다향관/다향관_1_매점.png"
            }
        ]
    },
    "만해관": {
        "복사기": [
            {
                location: "만해관 2층",
                img: "/편의시설이미지/만해관/만해관_2_복사기.png"
            }
        ]
    },
    "명진관": {
        "복사기": [
            {
                location: "명진관 1층",
                img: "/편의시설이미지/명진관/명진관_1_복사기.png"
            }
        ],
        "유인복사실": [
            {
                location: "명진관 1층",
                img: "/편의시설이미지/명진관/명진관_1_유인복사실.png"
            }
        ],
        "열람실": [
            {
                location: "명진관 1층 명진라운지",
                img: "/편의시설이미지/명진관/명진관_1_명진라운지.png"
            }
        ],
        "atm": [
            {
                location: "명진관 야외 신한",
                img: "/편의시설이미지/명진관/명진관_바깥_atm신한.png"
            }
        ]
    },
    "문화관": {
        "복사기": [
            {
                location: "문화관 1층",
                img: "/편의시설이미지/문화관/문화관_1_복사기.png"
            }
        ],
        "atm": [
            {
                location: "문화관 1층 신한",
                img: "/편의시설이미지/문화관/문화관_1_atm신한.png"
            }
        ],
        "증명서자동발급기": [
            {
                location: "문화관 1층",
                img: "/편의시설이미지/문화관/문화관_1_증명서자동발급기.png"
            }
        ],
        "제세동기": [
            {
                location: "문화관 1층",
                img: "/편의시설이미지/문화관/문화관_1_제세동기.png"
            }
        ]
    },
    "법학관": {
        "제세동기": [
            {
                location: "법학관 1층",
                img: "/편의시설이미지/법학관/법학관_1_제세동기.png"
            }
        ],
        "매점": [
            {
                location: "법학관 2층",
                img: "/편의시설이미지/법학관/법학만해관_2_매점.png"
            }
        ]
    },
    "본관": {
        "제세동기": [
            {
                location: "본관 3층",
                img: "/편의시설이미지/본관/본관_3_제세동기.png"
            }
        ],
        "카페": [
            {
                location: "본관 야외 가온누리",
                img: "/편의시설이미지/본관/본관_야외_카페가온누리.png"
            },
            {
                location: "본관 야외 블루포트",
                img: "/편의시설이미지/본관/본관_야외_카페블루포트.png"
            }
        ]
    },
    "사회과학관": {
        "복사기": [
            {
                location: "사회과학관 2층",
                img: "/편의시설이미지/사회과학관/사회과학관_2_복사기.png"
            }
        ],
        "열람실": [
            {
                location: "사회과학관 2층 능금",
                img: "/편의시설이미지/사회과학관/사화과학관_능금.png"
            }
        ],
        "증명서자동발급기": [
            {
                location: "사회과학관 2층",
                img: "/편의시설이미지/사회과학관/사회과학관_2_증명서자동발급기.png"
            }
        ],
        "제세동기": [
            {
                location: "사회과학관 2층",
                img: "/편의시설이미지/사회과학관/사회과학관_2_제세동기.png"
            }
        ]
    },
    "상록원": {
        "atm": [
            {
                location: "상록원 1층 신한 국민",
                img: "/편의시설이미지/상록원/상록원_1_atm신한국민.png"
            }
        ],
        "식당": [
            {
                location: "상록원 1층",
                img: "/편의시설이미지/상록원/상록원_1_식당.png"
            },
            {
                location: "상록원 2층",
                img: "/편의시설이미지/상록원/상록원_2_식당.png"
            },
            {
                location: "상록원 3층",
                img: "/편의시설이미지/상록원/상록원_3_식당.png"
            }
        ],
        "매점": [
            {
                location: "상록원 1층",
                img: "/편의시설이미지/상록원/상록원_1_매점.png"
            }
        ]
    },
    "신공학관": {
        "복사기": [
            {
                location: "신공학관 3층",
                img: "/편의시설이미지/신공학관/신공학관_3_복사기.png"
            },
            {
                location: "신공학관 9층",
                img: "/편의시설이미지/신공학관/신공학관_9_복사기.png"
            }
        ],
        "atm": [
            {
                location: "신공학관 1층 신한",
                img: "/편의시설이미지/신공학관/신공학관_1_atm신한.png"
            }
        ],
        "식당": [
            {
                location: "신공학관 1층",
                img: "/편의시설이미지/신공학관/신공학관_1_식당.png"
            }
        ],
        "카페": [
            {
                location: "신공학관 1층",
                img: "/편의시설이미지/신공학관/신공학관_1_카페.png"
            }
        ],
        "매점": [
            {
                location: "신공학관 1층",
                img: "/편의시설이미지/신공학관/신공학관_1_매점.png"
            }
        ]
    },
    "원흥관": {
        "복사기": [
            {
                location: "원흥관 3층",
                img: "/편의시설이미지/원흥관/원흥관_3_복사기.png"
            }
        ],
        "열람실": [
            {
                location: "원흥관 3층 북카페",
                img: "/편의시설이미지/원흥관/원흥관_3_북카페.png"
            },
            {
                location: "원흥관 3층 i space",
                img: "/편의시설이미지/원흥관/원흥관_3_아이스페이스.png"
            }
        ],
        "atm": [
            {
                location: "원흥관 4층 신한",
                img: "/편의시설이미지/원흥관/원흥관_4_atm신한.png"
            }
        ]
    },
    "정보문화관": {
        "복사기": [
            {
                location: "정보문화관P 3층",
                img: "/편의시설이미지/정보문화관P/정보문화관P_3층_복사기.png"
            }
        ]
    },
    "중앙도서관": {
        "복사기": [
            {
                location: "중앙도서관 지하2층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_B2_복사기(복사만).png"
            },
            {
                location: "중앙도서관 지하1층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_B1_복사기.png"
            },
            {
                location: "중앙도서관 지하1층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_B1_복사기(복사만).png"
            },
            {
                location: "중앙도서관 1층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_1_복사기(복사만).png"
            },
            {
                location: "중앙도서관 3층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_3_복사기(복사만).png",
            },
            {
                location: "중앙도서관 4층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_4_복사기.png"
            }
        ],
        "유인복사실": [
            {
                location: "중앙도서관 지하1층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_B1_유인복사실.png"
            }
        ],
        "증명서자동발급기": [
            {
                location: "중앙도서관 2층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_2_증명서자동발급기.png"
            }
        ],
        "매점": [
            {
                location: "중앙도서관 4층",
                img: "/편의시설이미지/중앙도서관/중앙도서관_4_매점.png"
            }
        ]
    },
    "학림관": {
        "복사기": [
            {
                location: "학림관 1층",
                img: "/편의시설이미지/학림관/학림관_1_복사기.png"
            },
            {
                location: "학림관 2층",
                img: "/편의시설이미지/학림관/학림관_2_복사기.png"
            }
        ],
        "열람실": [
            {
                location: "학림관 1층 라운지 샘",
                img: "/편의시설이미지/학림관/학림관_1_라운지.png"
            }
        ],
        "atm": [
            {
                location: "학림관 1층 신한",
                img: "/편의시설이미지/학림관/학림관_1_atm신한.png"
            }
        ],
        "증명서자동발급기": [
            {
                location: "학림관 1층",
                img: "/편의시설이미지/학림관/학림관_1_증명서자동발급기.png"
            }
        ],
        "제세동기": [
            {
                location: "학림관 1층",
                img: "/편의시설이미지/학림관/학림관_1_제세동기.png"
            }
        ],
        "매점": [
            {
                location: "학림관 지하1층",
                img: "/편의시설이미지/학림관/학림관_B1_매점.png"
            }
        ]
    },
    "학생회관": {
        "복사기": [
            {
                location: "학생회관 1층",
                img: "/편의시설이미지/학생회관/학생회관_1_복사기.png"
            }
        ],
        "열람실": [
            {
                location: "학생회관 1층 i space",
                img: "/편의시설이미지/학생회관/학생회관_1_아이스페이스.png"
            }
        ]
    },
    "학술관": {
        "복사기": [
            {
                location: "학술관 1층",
                img: "/편의시설이미지/학술관/학술관_1_복사기.png"
            }
        ],
        "식당": [
            {
                location: "학술관 지하1층 가든쿡",
                img: "/편의시설이미지/학술관/학술관_B1_식당가든쿡.png"
            }
        ],
        "카페": [
            {
                location: "학술관 지하1층 두리터",
                img: "/편의시설이미지/학술관/학술관_B1_카페.png"
            }
        ]
    },
    "혜화관": {
        "복사기": [
            {
                location: "혜화관 1층",
                img: "/편의시설이미지/혜화관/혜화관_1_복사기.png"
            }
        ],
        "열람실": [
            {
                location: "혜화관 1층 라운지",
                img: "/편의시설이미지/혜화관/혜화관_1_라운지.png"
            }
        ],
        "atm": [
            {
                location: "혜화관 1층 국민",
                img: "/편의시설이미지/혜화관/혜화관_1_atm국민.png"
            }
        ],
        "카페": [
            {
                location: "혜화관 1층 무인카페",
                img: "/편의시설이미지/혜화관/혜화관_1_무인카페.png"
            },
            {
                location: "혜화관 야외 카페ing",
                img: "/편의시설이미지/혜화관/혜화관_야외_카페ing.png"
            }
        ],
        "매점": [
            {
                location: "혜화관 4층",
                img: "/편의시설이미지/혜화관/혜화관_4_매점.png"
            }
        ]
    }
}
export default infoConv;